fonecmiddiplom120425/src/DataProcessors/ЗаполнениеГрафика/ЗаполнениеГрафика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗаполнениеГрафика</name>
  <attributes>
    <name>График</name>
    <type>
      <types>CatalogRef.Графики</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

fonecmiddiplom120425/src/InformationRegisters/ГрафикиРаботы/ГрафикиРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГрафикиРаботы</name>
  <resources>
    <name>КоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>График</name>
    <type>
      <types>CatalogRef.Графики</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmiddiplom120425/src/DataProcessors/ЗаполнениеГрафика/ObjectModule.bsl
Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни) Экспорт 
	
	Набор = РегистрыСведений.ГрафикиРаботы.СоздатьНаборЗаписей();
	Набор.Отбор.График.Установить(График);
	
	ЧислоСекундВСутках = 86400;
	
	Дат = ДатаНачала;
	
	Пока Дат <= ДатаОкончания Цикл
		Запись = Набор.Добавить();
		Запись.Дата = Дат;
		Запись.График = График;
		Если Найти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
			Запись.КоличествоДней = 0;
		Иначе	          
			Запись.КоличествоДней = 1;
		КонецЕсли; 
		Дат = Дат + ЧислоСекундВСутках;
	КонецЦикла; 
	
	Набор.Записать();
	
КонецПроцедуры
